#ಅನ್ತರ್ಭಾವ "cpy.hpp"

#ಅನ್ತರ್ಭಾವ <float.h>
#ಅನ್ತರ್ಭಾವ <vector>

#ಅನ್ತರ್ಭಾವ "dequantize.hpp"
#ಅನ್ತರ್ಭಾವ "ggml-sycl/common.hpp"
#ಅನ್ತರ್ಭಾವ "ggml-sycl/presets.hpp"
#ಅನ್ತರ್ಭಾವ "ggml.h"

ಸ್ಥಿರ ಶೂನ್ಯ cpy_1_f32_f32(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cxi, ಅಕ್ಷರ * cdsti) {
    ಸ್ಥಿರಾಂಕ ದಶಮಾಂಶ * xi   = (ಸ್ಥಿರಾಂಕ ದಶಮಾಂಶ *) cxi;
    ದಶಮಾಂಶ *       dsti = (ದಶಮಾಂಶ *) cdsti;

    *dsti = *xi;
}

ಸ್ಥಿರ ಶೂನ್ಯ cpy_1_f32_f16(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cxi, ಅಕ್ಷರ * cdsti) {
    ಸ್ಥಿರಾಂಕ ದಶಮಾಂಶ * xi   = (ಸ್ಥಿರಾಂಕ ದಶಮಾಂಶ *) cxi;
    sycl::half *  dsti = (sycl::half *) cdsti;

    *dsti = sycl::vec<ದಶಮಾಂಶ, 1>(*xi).convert<sycl::half, sycl::rounding_ಬಹುಲಕ::automatic>()[0];
}

ಸ್ಥಿರ ಶೂನ್ಯ cpy_1_f16_f16(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cxi, ಅಕ್ಷರ * cdsti) {
    ಸ್ಥಿರಾಂಕ sycl::half * xi   = (ಸ್ಥಿರಾಂಕ sycl::half *) cxi;
    sycl::half *       dsti = (sycl::half *) cdsti;

    *dsti = *xi;
}

ಸ್ಥಿರ ಶೂನ್ಯ cpy_1_f16_f32(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cxi, ಅಕ್ಷರ * cdsti) {
    ಸ್ಥಿರಾಂಕ sycl::half * xi   = (ಸ್ಥಿರಾಂಕ sycl::half *) cxi;
    ದಶಮಾಂಶ *            dsti = (ದಶಮಾಂಶ *) cdsti;

    *dsti = *xi;
}

ಸ್ಥಿರ ಶೂನ್ಯ cpy_1_i16_i16(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cxi, ಅಕ್ಷರ * cdsti) {
    ಸ್ಥಿರಾಂಕ int16_t * xi   = (ಸ್ಥಿರಾಂಕ int16_t *) cxi;
    int16_t *       dsti = (int16_t *) cdsti;

    *dsti = *xi;
}

ಸ್ಥಿರ ಶೂನ್ಯ cpy_1_i32_i32(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cxi, ಅಕ್ಷರ * cdsti) {
    ಸ್ಥಿರಾಂಕ int32_t * xi   = (ಸ್ಥಿರಾಂಕ int32_t *) cxi;
    int32_t *       dsti = (int32_t *) cdsti;

    *dsti = *xi;
}

ಸ್ಥಿರ ಶೂನ್ಯ cpy_1_f32_i32(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cxi, ಅಕ್ಷರ * cdsti) {
    ಸ್ಥಿರಾಂಕ ದಶಮಾಂಶ * xi     = (ಸ್ಥಿರಾಂಕ ದಶಮಾಂಶ *) cxi;
    int32_t *     dsti   = (int32_t *) cdsti;

    *dsti = (int32_t) *xi;
}

ಸ್ಥಿರ ಶೂನ್ಯ cpy_1_i32_f32(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cxi, ಅಕ್ಷರ * cdsti) {
    ಸ್ಥಿರಾಂಕ int32_t * xi   = (ಸ್ಥಿರಾಂಕ int32_t *) cxi;
    ದಶಮಾಂಶ *         dsti = (ದಶಮಾಂಶ *) cdsti;

    *dsti = (ದಶಮಾಂಶ) *xi;
}

#ವ್ಯಾಖ್ಯಾನಿತವಾದರೆ GGML_SYCL_HAS_BF16
ಸ್ಥಿರ ಶೂನ್ಯ cpy_1_f32_bf16(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cxi, ಅಕ್ಷರ * cdsti) {
    ಸ್ಥಿರಾಂಕ ದಶಮಾಂಶ * xi   = (ಸ್ಥಿರಾಂಕ ದಶಮಾಂಶ *) cxi;
    sycl::ext::oneapi::bfloat16 *  dsti = (sycl::ext::oneapi::bfloat16 *) cdsti;

    *dsti = sycl::ext::oneapi::bfloat16(*xi);
}

ಸ್ಥಿರ ಶೂನ್ಯ cpy_1_bf16_f32(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cxi, ಅಕ್ಷರ * cdsti) {
    ಸ್ಥಿರಾಂಕ sycl::ext::oneapi::bfloat16 * xi   = (ಸ್ಥಿರಾಂಕ sycl::ext::oneapi::bfloat16 *) cxi;
    ದಶಮಾಂಶ *            dsti = (ದಶಮಾಂಶ *) cdsti;

    *dsti = static_cast<ದಶಮಾಂಶ>(*xi);
}

ಸ್ಥಿರ ಶೂನ್ಯ cpy_1_bf16_bf16(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cxi, ಅಕ್ಷರ * cdsti) {
    ಸ್ಥಿರಾಂಕ sycl::ext::oneapi::bfloat16 * xi   = (ಸ್ಥಿರಾಂಕ sycl::ext::oneapi::bfloat16 *) cxi;
    sycl::ext::oneapi::bfloat16 *       dsti = (sycl::ext::oneapi::bfloat16 *) cdsti;

    *dsti = *xi;
}

ಸ್ಥಿರ ಶೂನ್ಯ cpy_1_f16_bf16(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cxi, ಅಕ್ಷರ * cdsti) {
    ಸ್ಥಿರಾಂಕ sycl::half * xi   = (ಸ್ಥಿರಾಂಕ sycl::half *) cxi;
    sycl::ext::oneapi::bfloat16 *  dsti = (sycl::ext::oneapi::bfloat16 *) cdsti;

    *dsti = sycl::ext::oneapi::bfloat16(static_cast<ದಶಮಾಂಶ>(*xi));
}

ಸ್ಥಿರ ಶೂನ್ಯ cpy_1_bf16_f16(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cxi, ಅಕ್ಷರ * cdsti) {
    ಸ್ಥಿರಾಂಕ sycl::ext::oneapi::bfloat16 * xi   = (ಸ್ಥಿರಾಂಕ sycl::ext::oneapi::bfloat16 *) cxi;
    sycl::half *            dsti = (sycl::half *) cdsti;

    *dsti = sycl::half(static_cast<ದಶಮಾಂಶ>(*xi));
}
#ಆದರೆ_ಅಂತ್ಯ

ಮಾದರಿ <cpy_kernel_t cpy_1>
ಸ್ಥಿರ ಶೂನ್ಯ cpy_f32_f16(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02,
                        ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11,
                        ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13,
                        ಸ್ಥಿರಾಂಕ sycl::nd_ಅಂಶ<3> & ಅಂಶ_ct1) {
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ i = ಅಂಶ_ct1.get_local_range(2) * ಅಂಶ_ct1.get_ಗುಂಪು(2) + ಅಂಶ_ct1.get_local_id(2);

    ಆದರೆ (i >= ne) {
        ಹಿಂತಿರುಗಿ;
    }

    // determine indices i02/i12, i01/i11, i00/i10 as a function of index i of flattened tensor
    // then combine those indices with the corresponding byte offsets to get the total offsets
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ i03      = i / (ne00 * ne01 * ne02);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ i02      = (i - i03 * ne00 * ne01 * ne02) / (ne00 * ne01);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ i01      = (i - i03 * ne00 * ne01 * ne02 - i02 * ne01 * ne00) / ne00;
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ i00      = i - i03 * ne00 * ne01 * ne02 - i02 * ne01 * ne00 - i01 * ne00;
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ x_ಸ್ಥಾನಾಂತರ = i00 * nb00 + i01 * nb01 + i02 * nb02 + i03 * nb03;

    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ i13        = i / (ne10 * ne11 * ne12);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ i12        = (i - i13 * ne10 * ne11 * ne12) / (ne10 * ne11);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ i11        = (i - i13 * ne10 * ne11 * ne12 - i12 * ne10 * ne11) / ne10;
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ i10        = i - i13 * ne10 * ne11 * ne12 - i12 * ne10 * ne11 - i11 * ne10;
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ dst_ಸ್ಥಾನಾಂತರ = i10 * nb10 + i11 * nb11 + i12 * nb12 + i13 * nb13;

    cpy_1(cx + x_ಸ್ಥಾನಾಂತರ, cdst + dst_ಸ್ಥಾನಾಂತರ);
}


/* quantized type same copy */
ಮಾದರಿ<ಬಗೆ_ಹೆಸರು T>
ಸ್ಥಿರ ಶೂನ್ಯ cpy_blck_q_q(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cxi, ಅಕ್ಷರ * cdsti) {
    ಸ್ಥಿರಾಂಕ T * xi = (ಸ್ಥಿರಾಂಕ T *) cxi;
    T * dsti = (T *) cdsti;
    *dsti = *xi;
}


ಸ್ಥಿರ ಶೂನ್ಯ cpy_blck_q8_0_f32(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cxi, ಅಕ್ಷರ * cdsti) {
    ದಶಮಾಂಶ * cdstf = (ದಶಮಾಂಶ *) (cdsti);

    ಗಾಗಿ (ಪೂರ್ಣಾಂಕ j = 0; j < QK8_0; j += 2) {
        dfloat2 dq;
        dequantize_q8_0(cxi, 0, j, dq);
        *(cdstf + j)     = dq.x();
        *(cdstf + j + 1) = dq.y();
    }
}

ಸ್ಥಿರ ಶೂನ್ಯ cpy_blck_q2_0_f32(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cxi, ಅಕ್ಷರ * cdsti) {
    ಸ್ಥಿರಾಂಕ ಖಂಡ_q2_0 * xi = (ಸ್ಥಿರಾಂಕ ಖಂಡ_q2_0 *) cxi;
    ದಶಮಾಂಶ * cdstf = (ದಶಮಾಂಶ *) cdsti;

    ಸ್ಥಿರಾಂಕ ದಶಮಾಂಶ d = xi->d;

    ಗಾಗಿ (ಪೂರ್ಣಾಂಕ j = 0; j < QK2_0; ++j) {
        ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ byte_ಸೂಚ್ಯಂಕ = j / 4;
        ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಬಿಟ್_ಸ್ಥಾನಾಂತರ = (j % 4) * 2;
        ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ q = (xi->qs[byte_ಸೂಚ್ಯಂಕ] >> ಬಿಟ್_ಸ್ಥಾನಾಂತರ) & 0x3;
        cdstf[j] = (ದಶಮಾಂಶ) (q - 1) * d;
    }
}



ಮಾದರಿ <dequantize_kernel_t dequant, ಪೂರ್ಣಾಂಕ qk> ಸ್ಥಿರ ಶೂನ್ಯ cpy_blck_q_f32(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cxi, ಅಕ್ಷರ * cdsti) {
    ದಶಮಾಂಶ * cdstf = (ದಶಮಾಂಶ *) (cdsti);

    ಗಾಗಿ (ಪೂರ್ಣಾಂಕ j = 0; j < qk / 2; j++) {
        dfloat2 dq;
        dequant(cxi, 0, j, dq);
        *(cdstf + j)          = dq.x();
        *(cdstf + j + qk / 2) = dq.y();
    }
}


ಮಾದರಿ <ಬಗೆ_ಹೆಸರು T, ಪೂರ್ಣಾಂಕ qk>
ಸ್ಥಿರ ಶೂನ್ಯ cpy_q_q(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02,
                      ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11,
                      ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13,
                      ಸ್ಥಿರಾಂಕ sycl::nd_ಅಂಶ<3> & ಅಂಶ_ct1) {
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ i = (ಅಂಶ_ct1.get_local_range(2) * ಅಂಶ_ct1.get_ಗುಂಪು(2) + ಅಂಶ_ct1.get_local_id(2)) * qk;

    ಆದರೆ (i >= ne) {
        ಹಿಂತಿರುಗಿ;
    }

    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ i03      = i / (ne00 * ne01 * ne02);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ i02      = (i - i03 * ne00 * ne01 * ne02) / (ne00 * ne01);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ i01      = (i - i03 * ne00 * ne01 * ne02 - i02 * ne01 * ne00) / ne00;
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ i00      = i - i03 * ne00 * ne01 * ne02 - i02 * ne01 * ne00 - i01 * ne00;
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ x_ಸ್ಥಾನಾಂತರ = (i00 / qk) * nb00 + i01 * nb01 + i02 * nb02 + i03 * nb03;


    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ i13        = i / (ne10 * ne11 * ne12);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ i12        = (i - i13 * ne10 * ne11 * ne12) / (ne10 * ne11);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ i11        = (i - i13 * ne10 * ne11 * ne12 - i12 * ne10 * ne11) / ne10;
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ i10        = i - i13 * ne10 * ne11 * ne12 - i12 * ne10 * ne11 - i11 * ne10;
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ dst_ಸ್ಥಾನಾಂತರ = (i10 / qk) * nb10 + i11 * nb11 + i12 * nb12 + i13 * nb13;

    cpy_blck_q_q<T>(cx + x_ಸ್ಥಾನಾಂತರ, cdst + dst_ಸ್ಥಾನಾಂತರ);
}

ಮಾದರಿ <cpy_kernel_t cpy_blck, ಪೂರ್ಣಾಂಕ qk>
ಸ್ಥಿರ ಶೂನ್ಯ cpy_f32_q(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02,
                      ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11,
                      ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13,
                      ಸ್ಥಿರಾಂಕ sycl::nd_ಅಂಶ<3> & ಅಂಶ_ct1) {
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ i = (ಅಂಶ_ct1.get_local_range(2) * ಅಂಶ_ct1.get_ಗುಂಪು(2) + ಅಂಶ_ct1.get_local_id(2)) * qk;

    ಆದರೆ (i >= ne) {
        ಹಿಂತಿರುಗಿ;
    }


    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ i03      = i / (ne00 * ne01 * ne02);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ i02      = (i - i03 * ne00 * ne01 * ne02) / (ne00 * ne01);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ i01      = (i - i03 * ne00 * ne01 * ne02 - i02 * ne01 * ne00) / ne00;
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ i00      = i - i03 * ne00 * ne01 * ne02 - i02 * ne01 * ne00 - i01 * ne00;
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ x_ಸ್ಥಾನಾಂತರ = i00 * nb00 + i01 * nb01 + i02 * nb02 + i03 * nb03;

    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ i13        = i / (ne10 * ne11 * ne12);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ i12        = (i - i13 * ne10 * ne11 * ne12) / (ne10 * ne11);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ i11        = (i - i13 * ne10 * ne11 * ne12 - i12 * ne10 * ne11) / ne10;
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ i10        = i - i13 * ne10 * ne11 * ne12 - i12 * ne10 * ne11 - i11 * ne10;
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ dst_ಸ್ಥಾನಾಂತರ = (i10 / qk) * nb10 + i11 * nb11 + i12 * nb12 + i13 * nb13;

    cpy_blck(cx + x_ಸ್ಥಾನಾಂತರ, cdst + dst_ಸ್ಥಾನಾಂತರ);
}

ಮಾದರಿ <cpy_kernel_t cpy_blck, ಪೂರ್ಣಾಂಕ qk>
ಸ್ಥಿರ ಶೂನ್ಯ cpy_q_f32(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02,
                      ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11,
                      ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13,
                      ಸ್ಥಿರಾಂಕ sycl::nd_ಅಂಶ<3> & ಅಂಶ_ct1) {
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ i = (ಅಂಶ_ct1.get_local_range(2) * ಅಂಶ_ct1.get_ಗುಂಪು(2) + ಅಂಶ_ct1.get_local_id(2)) * qk;

    ಆದರೆ (i >= ne) {
        ಹಿಂತಿರುಗಿ;
    }

    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ i03      = i / (ne00 * ne01 * ne02);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ i02      = (i - i03 * ne00 * ne01 * ne02) / (ne00 * ne01);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ i01      = (i - i03 * ne00 * ne01 * ne02 - i02 * ne01 * ne00) / ne00;
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ i00      = i - i03 * ne00 * ne01 * ne02 - i02 * ne01 * ne00 - i01 * ne00;
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ x_ಸ್ಥಾನಾಂತರ = (i00 / qk) * nb00 + i01 * nb01 + i02 * nb02 + i03 * nb03;

    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ i13        = i / (ne10 * ne11 * ne12);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ i12        = (i - i13 * ne10 * ne11 * ne12) / (ne10 * ne11);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ i11        = (i - i13 * ne10 * ne11 * ne12 - i12 * ne10 * ne11) / ne10;
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ i10        = i - i13 * ne10 * ne11 * ne12 - i12 * ne10 * ne11 - i11 * ne10;
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ dst_ಸ್ಥಾನಾಂತರ = i10 * nb10 + i11 * nb11 + i12 * nb12 + i13 * nb13;

    cpy_blck(cx + x_ಸ್ಥಾನಾಂತರ, cdst + dst_ಸ್ಥಾನಾಂತರ);
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_f16_f32_sycl(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = (ne + SYCL_CPY_ಖಂಡ_ಗಾತ್ರ - 1) / SYCL_CPY_ಖಂಡ_ಗಾತ್ರ;
    {
        dpct::has_capability_or_fail(stream->get_device(), { sycl::aspect::fp16 });

        stream->parallel_for(
            sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ),
                              sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
            [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
                cpy_f32_f16<cpy_1_f16_f32>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12,
                                           nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
            });
    }
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_f32_f32_sycl(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = (ne + SYCL_CPY_ಖಂಡ_ಗಾತ್ರ - 1) / SYCL_CPY_ಖಂಡ_ಗಾತ್ರ;
    {
        dpct::has_capability_or_fail(stream->get_device(), { sycl::aspect::fp16 });

        stream->parallel_for(
            sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ),
                              sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
            [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
                cpy_f32_f16<cpy_1_f32_f32>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12,
                                           nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
            });
    }
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_f32_f16_sycl(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = (ne + SYCL_CPY_ಖಂಡ_ಗಾತ್ರ - 1) / SYCL_CPY_ಖಂಡ_ಗಾತ್ರ;
    {
        dpct::has_capability_or_fail(stream->get_device(), { sycl::aspect::fp16 });

        stream->parallel_for(
            sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ),
                              sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
            [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
                cpy_f32_f16<cpy_1_f32_f16>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12,
                                           nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
            });
    }
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_f32_i32_sycl(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = (ne + SYCL_CPY_ಖಂಡ_ಗಾತ್ರ - 1) / SYCL_CPY_ಖಂಡ_ಗಾತ್ರ;
    {
        stream->parallel_for(
            sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ),
                              sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
            [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
                cpy_f32_f16<cpy_1_f32_i32>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12,
                                           nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
            });
    }
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_i32_f32_sycl(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = (ne + SYCL_CPY_ಖಂಡ_ಗಾತ್ರ - 1) / SYCL_CPY_ಖಂಡ_ಗಾತ್ರ;
    {
        stream->parallel_for(
            sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ),
                              sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
            [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
                cpy_f32_f16<cpy_1_i32_f32>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12,
                                           nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
            });
    }
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_f32_q8_0_sycl(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK8_0 == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK8_0, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ),
                                           sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
                         [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
                             cpy_f32_q<cpy_blck_f32_q8_0, QK8_0>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03,
                                                                 ne10, ne11, ne12, nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
                         });
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_q8_0_f32_sycl(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK8_0 == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK8_0, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ),
                                           sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
                         [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
                             cpy_q_f32<cpy_blck_q8_0_f32, QK8_0>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03,
                                                                 ne10, ne11, ne12, nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
                         });
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_q2_0_f32_sycl(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK2_0 == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK2_0, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(
        sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ),
                          sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
        [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]] {
            cpy_q_f32<cpy_blck_q2_0_f32, QK2_0>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11,
                                                ne12, nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
        });
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_f32_q4_0_sycl(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK4_0 == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK4_0, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ),
                                           sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
                         [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
                             cpy_f32_q<cpy_blck_f32_q4_0, QK4_0>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03,
                                                                 ne10, ne11, ne12, nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
                         });
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_q4_0_f32_sycl(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK4_0 == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK4_0, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(
        sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ),
                          sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
        [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
            cpy_q_f32<cpy_blck_q_f32<dequantize_q4_0, QK4_0>, QK4_0>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02,
                                                                     nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13,
                                                                     ಅಂಶ_ct1);
        });
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_f32_q4_1_sycl(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK4_1 == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK4_1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ),
                                           sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
                         [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
                             cpy_f32_q<cpy_blck_f32_q4_1, QK4_1>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03,
                                                                 ne10, ne11, ne12, nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
                         });
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_q4_1_f32_sycl(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK4_1 == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK4_1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(
        sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ),
                          sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
        [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
            cpy_q_f32<cpy_blck_q_f32<dequantize_q4_1, QK4_1>, QK4_1>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02,
                                                                     nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13,
                                                                     ಅಂಶ_ct1);
        });
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_f32_q5_0_sycl(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK5_0 == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK5_0, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ),
                                           sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
                         [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]] {
                             cpy_f32_q<cpy_blck_f32_q5_0, QK5_0>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03,
                                                                 ne10, ne11, ne12, nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
                         });
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_q5_0_f32_sycl(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK5_0 == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK5_0, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(
        sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ),
                          sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
        [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
            cpy_q_f32<cpy_blck_q_f32<dequantize_q5_0, QK5_0>, QK5_0>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02,
                                                                     nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13,
                                                                     ಅಂಶ_ct1);
        });
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_f32_q5_1_sycl(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK5_1 == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK5_1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ),
                                           sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
                         [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
                             cpy_f32_q<cpy_blck_f32_q5_1, QK5_1>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03,
                                                                 ne10, ne11, ne12, nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
                         });
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_q5_1_f32_sycl(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK5_1 == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK5_1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(
        sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ),
                          sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
        [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
            cpy_q_f32<cpy_blck_q_f32<dequantize_q5_1, QK5_1>, QK5_1>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02,
                                                                     nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13,
                                                                     ಅಂಶ_ct1);
        });
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_mxfp4_f32_sycl(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK_MXFP4 == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK_MXFP4, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(
        sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ),
                          sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
        [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]] {
            cpy_q_f32<cpy_blck_q_f32<dequantize_mxfp4, QK_MXFP4>, QK_MXFP4>(cx, cdst, ne, ne00, ne01, ne02, nb00,
                                                                             nb01, nb02, nb03, ne10, ne11, ne12,
                                                                             nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
        });
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_f32_iq4_nl_sycl(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                     ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                     ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                     ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK4_NL == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK4_NL, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(
        sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ),
                          sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
        [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]] {
            cpy_f32_q<cpy_blck_f32_iq4_nl, QK4_NL>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11,
                                                   ne12, nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
        });
}

ಸ್ಥಿರ ಶೂನ್ಯ cpy_blck_f16_q4_0(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cxi, ಅಕ್ಷರ * cdsti) {
    ಸ್ಥಿರಾಂಕ sycl::half * xi = (ಸ್ಥಿರಾಂಕ sycl::half *) cxi;
    ದಶಮಾಂಶ xf[QK4_0];

    ಗಾಗಿ (ಪೂರ್ಣಾಂಕ j = 0; j < QK4_0; ++j) {
        xf[j] = (ದಶಮಾಂಶ) xi[j];
    }

    cpy_blck_f32_q4_0((ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *) xf, cdsti);
}

ಸ್ಥಿರ ಶೂನ್ಯ cpy_blck_f16_q4_1(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cxi, ಅಕ್ಷರ * cdsti) {
    ಸ್ಥಿರಾಂಕ sycl::half * xi = (ಸ್ಥಿರಾಂಕ sycl::half *) cxi;
    ದಶಮಾಂಶ xf[QK4_1];

    ಗಾಗಿ (ಪೂರ್ಣಾಂಕ j = 0; j < QK4_1; ++j) {
        xf[j] = (ದಶಮಾಂಶ) xi[j];
    }

    cpy_blck_f32_q4_1((ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *) xf, cdsti);
}

ಸ್ಥಿರ ಶೂನ್ಯ cpy_blck_f16_q5_0(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cxi, ಅಕ್ಷರ * cdsti) {
    ಸ್ಥಿರಾಂಕ sycl::half * xi = (ಸ್ಥಿರಾಂಕ sycl::half *) cxi;
    ದಶಮಾಂಶ xf[QK5_0];

    ಗಾಗಿ (ಪೂರ್ಣಾಂಕ j = 0; j < QK5_0; ++j) {
        xf[j] = (ದಶಮಾಂಶ) xi[j];
    }

    cpy_blck_f32_q5_0((ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *) xf, cdsti);
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_f16_q4_0_sycl(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK4_0 == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK4_0, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ),
                                           sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
                         [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
                             cpy_f32_q<cpy_blck_f16_q4_0, QK4_0>(cx, cdst, ne, ne00, ne01, ne02,
                                                                 nb00, nb01, nb02, nb03,
                                                                 ne10, ne11, ne12, nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
                         });
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_f16_q4_1_sycl(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK4_1 == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK4_1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ),
                                           sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
                         [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
                             cpy_f32_q<cpy_blck_f16_q4_1, QK4_1>(cx, cdst, ne, ne00, ne01, ne02,
                                                                 nb00, nb01, nb02, nb03,
                                                                 ne10, ne11, ne12, nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
                         });
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_f16_q5_0_sycl(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK5_0 == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK5_0, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ),
                                           sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
                         [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
                             cpy_f32_q<cpy_blck_f16_q5_0, QK5_0>(cx, cdst, ne, ne00, ne01, ne02,
                                                                 nb00, nb01, nb02, nb03,
                                                                 ne10, ne11, ne12, nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
                         });
}

ಸ್ಥಿರ ತಾರ್ಕಿಕ ggml_sycl_is_quantized_type(ಎಣಿಕೆ ggml_type type) {
    ಆಯ್ಕೆ (type) {
        ಸ್ಥಿತಿ GGML_TYPE_Q1_0:
        ಸ್ಥಿತಿ GGML_TYPE_Q2_0:
        ಸ್ಥಿತಿ GGML_TYPE_Q4_0:
        ಸ್ಥಿತಿ GGML_TYPE_Q4_1:
        ಸ್ಥಿತಿ GGML_TYPE_Q5_0:
        ಸ್ಥಿತಿ GGML_TYPE_Q5_1:
        ಸ್ಥಿತಿ GGML_TYPE_Q8_0:
        ಸ್ಥಿತಿ GGML_TYPE_MXFP4:
        ಸ್ಥಿತಿ GGML_TYPE_NVFP4:
        ಸ್ಥಿತಿ GGML_TYPE_Q2_K:
        ಸ್ಥಿತಿ GGML_TYPE_Q3_K:
        ಸ್ಥಿತಿ GGML_TYPE_Q4_K:
        ಸ್ಥಿತಿ GGML_TYPE_Q5_K:
        ಸ್ಥಿತಿ GGML_TYPE_Q6_K:
        ಸ್ಥಿತಿ GGML_TYPE_IQ2_XXS:
        ಸ್ಥಿತಿ GGML_TYPE_IQ2_XS:
        ಸ್ಥಿತಿ GGML_TYPE_IQ2_S:
        ಸ್ಥಿತಿ GGML_TYPE_IQ3_XXS:
        ಸ್ಥಿತಿ GGML_TYPE_IQ3_S:
        ಸ್ಥಿತಿ GGML_TYPE_IQ1_S:
        ಸ್ಥಿತಿ GGML_TYPE_IQ1_M:
        ಸ್ಥಿತಿ GGML_TYPE_IQ4_NL:
        ಸ್ಥಿತಿ GGML_TYPE_IQ4_XS:
            ಹಿಂತಿರುಗಿ ನಿಜ;
        ಪೂರ್ವನಿಯೋಜಿತ:
            ಹಿಂತಿರುಗಿ ಸುಳ್ಳು;
    }
}

ಸ್ಥಿರ ತಾರ್ಕಿಕ ggml_sycl_can_quantize_ಅಡ್ಡಸಾಲುಗಳು_sycl(ಎಣಿಕೆ ggml_type type) {
    ಆಯ್ಕೆ (type) {
        ಸ್ಥಿತಿ GGML_TYPE_Q1_0:
        ಸ್ಥಿತಿ GGML_TYPE_Q2_0:
        ಸ್ಥಿತಿ GGML_TYPE_Q4_0:
        ಸ್ಥಿತಿ GGML_TYPE_Q4_1:
        ಸ್ಥಿತಿ GGML_TYPE_Q5_0:
        ಸ್ಥಿತಿ GGML_TYPE_Q5_1:
        ಸ್ಥಿತಿ GGML_TYPE_Q8_0:
        ಸ್ಥಿತಿ GGML_TYPE_MXFP4:
        ಸ್ಥಿತಿ GGML_TYPE_NVFP4:
        ಸ್ಥಿತಿ GGML_TYPE_Q2_K:
        ಸ್ಥಿತಿ GGML_TYPE_Q3_K:
        ಸ್ಥಿತಿ GGML_TYPE_Q4_K:
        ಸ್ಥಿತಿ GGML_TYPE_Q5_K:
        ಸ್ಥಿತಿ GGML_TYPE_Q6_K:
        ಸ್ಥಿತಿ GGML_TYPE_IQ4_NL:
        ಸ್ಥಿತಿ GGML_TYPE_IQ4_XS:
            ಹಿಂತಿರುಗಿ ನಿಜ;
        ಪೂರ್ವನಿಯೋಜಿತ:
            ಹಿಂತಿರುಗಿ ಸುಳ್ಳು;
    }
}

ಮಾದರಿ <ಬಗೆ_ಹೆಸರು SrcScalar>
ಸ್ಥಿರ ಸಾಲೊಳಗೆ ದಶಮಾಂಶ ggml_sycl_src_ಗಮ್ಯ_f32(ಸ್ಥಿರಾಂಕ SrcScalar & x) {
    ಹಿಂತಿರುಗಿ (ದಶಮಾಂಶ) x;
}

#ವ್ಯಾಖ್ಯಾನಿತವಾದರೆ GGML_SYCL_HAS_BF16
ಮಾದರಿ <>
ಸಾಲೊಳಗೆ ದಶಮಾಂಶ ggml_sycl_src_ಗಮ್ಯ_f32<sycl::ext::oneapi::bfloat16>(ಸ್ಥಿರಾಂಕ sycl::ext::oneapi::bfloat16 & x) {
    ಹಿಂತಿರುಗಿ static_cast<ದಶಮಾಂಶ>(x);
}

ಮಾದರಿ <>
ಸಾಲೊಳಗೆ ದಶಮಾಂಶ ggml_sycl_src_ಗಮ್ಯ_f32<ggml_bf16_t>(ಸ್ಥಿರಾಂಕ ggml_bf16_t & x) {
    ಒಕ್ಕೂಟ {
        uint32_t u32;
        ದಶಮಾಂಶ f32;
    } value;

    value.u32 = (uint32_t) x.ಬಿಟ್ಟುಗಳು << 16;
    ಹಿಂತಿರುಗಿ value.f32;
}
#ಆದರೆ_ಅಂತ್ಯ

ಮಾದರಿ <ಬಗೆ_ಹೆಸರು SrcScalar, cpy_kernel_t quantize_ಖಂಡ, ಪೂರ್ಣಾಂಕ qk>
ಸ್ಥಿರ ಶೂನ್ಯ ggml_sycl_quantize_ಅಡ್ಡಸಾಲುಗಳು_q(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ int64_t ne,
                                      ಸ್ಥಿರಾಂಕ int64_t ne00, ಸ್ಥಿರಾಂಕ int64_t ne01, ಸ್ಥಿರಾಂಕ int64_t ne02,
                                      ಸ್ಥಿರಾಂಕ size_t nb00, ಸ್ಥಿರಾಂಕ size_t nb01, ಸ್ಥಿರಾಂಕ size_t nb02, ಸ್ಥಿರಾಂಕ size_t nb03,
                                      ಸ್ಥಿರಾಂಕ int64_t ne10, ಸ್ಥಿರಾಂಕ int64_t ne11, ಸ್ಥಿರಾಂಕ int64_t ne12,
                                      ಸ್ಥಿರಾಂಕ size_t nb10, ಸ್ಥಿರಾಂಕ size_t nb11, ಸ್ಥಿರಾಂಕ size_t nb12, ಸ್ಥಿರಾಂಕ size_t nb13,
                                      ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % qk == 0);
    GGML_ASSERT(ne00 % qk == 0);

    ಸ್ಥಿರಾಂಕ int64_t ಒಟ್ಟು_ಖಂಡಗಳು = ne / qk;
    constexpr ಪೂರ್ಣಾಂಕ ಖಂಡ_ಗಾತ್ರ_3 = 256;
    ಸ್ಥಿರಾಂಕ int64_t grid_ಗಾತ್ರ = ceil_div(ಒಟ್ಟು_ಖಂಡಗಳು, (int64_t) ಖಂಡ_ಗಾತ್ರ_3);

    stream->parallel_for(sycl::nd_range<1>(grid_ಗಾತ್ರ * ಖಂಡ_ಗಾತ್ರ_3, ಖಂಡ_ಗಾತ್ರ_3),
                        [=](sycl::nd_ಅಂಶ<1> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]] {
        ಸ್ಥಿರಾಂಕ int64_t ಖಂಡ_idx = ಅಂಶ_ct1.get_global_ರೇಖೀಯ_id();
        ಆದರೆ (ಖಂಡ_idx >= ಒಟ್ಟು_ಖಂಡಗಳು) {
            ಹಿಂತಿರುಗಿ;
        }

        ಸ್ಥಿರಾಂಕ int64_t i = ಖಂಡ_idx * qk;

        ಸ್ಥಿರಾಂಕ int64_t i03 = i / (ne00 * ne01 * ne02);
        ಸ್ಥಿರಾಂಕ int64_t i02 = (i - i03 * ne00 * ne01 * ne02) / (ne00 * ne01);
        ಸ್ಥಿರಾಂಕ int64_t i01 = (i - i03 * ne00 * ne01 * ne02 - i02 * ne01 * ne00) / ne00;
        ಸ್ಥಿರಾಂಕ int64_t i00 = i - i03 * ne00 * ne01 * ne02 - i02 * ne01 * ne00 - i01 * ne00;
        ಸ್ಥಿರಾಂಕ size_t x_ಸ್ಥಾನಾಂತರ = i00 * nb00 + i01 * nb01 + i02 * nb02 + i03 * nb03;

        ಸ್ಥಿರಾಂಕ int64_t i13 = i / (ne10 * ne11 * ne12);
        ಸ್ಥಿರಾಂಕ int64_t i12 = (i - i13 * ne10 * ne11 * ne12) / (ne10 * ne11);
        ಸ್ಥಿರಾಂಕ int64_t i11 = (i - i13 * ne10 * ne11 * ne12 - i12 * ne10 * ne11) / ne10;
        ಸ್ಥಿರಾಂಕ int64_t i10 = i - i13 * ne10 * ne11 * ne12 - i12 * ne10 * ne11 - i11 * ne10;
        ಸ್ಥಿರಾಂಕ size_t dst_ಸ್ಥಾನಾಂತರ = (i10 / qk) * nb10 + i11 * nb11 + i12 * nb12 + i13 * nb13;

        ದಶಮಾಂಶ xf[qk];
        ಆದರೆ (nb00 == ಗಾತ್ರ(SrcScalar)) {
            ಸ್ಥಿರಾಂಕ SrcScalar * src_ಅಡ್ಡಸಾಲು = (ಸ್ಥಿರಾಂಕ SrcScalar *) (cx + x_ಸ್ಥಾನಾಂತರ);
            ಗಾಗಿ (ಪೂರ್ಣಾಂಕ j = 0; j < qk; ++j) {
                xf[j] = ggml_sycl_src_ಗಮ್ಯ_f32(src_ಅಡ್ಡಸಾಲು[j]);
            }
        } ಇಲ್ಲದಿದ್ದರೆ {
            ಗಾಗಿ (ಪೂರ್ಣಾಂಕ j = 0; j < qk; ++j) {
                ಸ್ಥಿರಾಂಕ SrcScalar * src_val = (ಸ್ಥಿರಾಂಕ SrcScalar *) (cx + x_ಸ್ಥಾನಾಂತರ + j * nb00);
                xf[j] = ggml_sycl_src_ಗಮ್ಯ_f32(*src_val);
            }
        }

        quantize_ಖಂಡ((ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *) xf, cdst + dst_ಸ್ಥಾನಾಂತರ);
    });
}

ಮಾದರಿ <ಬಗೆ_ಹೆಸರು SrcScalar>
ಸ್ಥಿರ ಶೂನ್ಯ ggml_sycl_quantize_ಅಡ್ಡಸಾಲುಗಳು_sycl(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ggml_tensor * src0, ಸ್ಥಿರಾಂಕ ggml_tensor * src1,
                                         ಸ್ಥಿರಾಂಕ int64_t ne, ಸ್ಥಿರಾಂಕ int64_t ne00, ಸ್ಥಿರಾಂಕ int64_t ne01, ಸ್ಥಿರಾಂಕ int64_t ne02,
                                         ಸ್ಥಿರಾಂಕ size_t nb00, ಸ್ಥಿರಾಂಕ size_t nb01, ಸ್ಥಿರಾಂಕ size_t nb02, ಸ್ಥಿರಾಂಕ size_t nb03,
                                         ಸ್ಥಿರಾಂಕ int64_t ne10, ಸ್ಥಿರಾಂಕ int64_t ne11, ಸ್ಥಿರಾಂಕ int64_t ne12, ಸ್ಥಿರಾಂಕ size_t nb10,
                                         ಸ್ಥಿರಾಂಕ size_t nb11, ಸ್ಥಿರಾಂಕ size_t nb12, ಸ್ಥಿರಾಂಕ size_t nb13, ಸರತಿ_ptr stream) {
    GGML_ಬಳಸದ(src0);
    GGML_ಬಳಸದ(src1);

    ಆಯ್ಕೆ (src1->type) {
        ಸ್ಥಿತಿ GGML_TYPE_Q8_0:
            ggml_sycl_quantize_ಅಡ್ಡಸಾಲುಗಳು_q<SrcScalar, cpy_blck_f32_q8_0, QK8_0>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01,
                                                                            nb02, nb03, ne10, ne11, ne12, nb10, nb11,
                                                                            nb12, nb13, stream);
            ನಿಲ್ಲಿಸು;
        ಸ್ಥಿತಿ GGML_TYPE_Q1_0:
            ggml_sycl_quantize_ಅಡ್ಡಸಾಲುಗಳು_q<SrcScalar, cpy_blck_f32_q1_0, QK1_0>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01,
                                                                            nb02, nb03, ne10, ne11, ne12, nb10, nb11,
                                                                            nb12, nb13, stream);
            ನಿಲ್ಲಿಸು;
        ಸ್ಥಿತಿ GGML_TYPE_Q2_0:
            ggml_sycl_quantize_ಅಡ್ಡಸಾಲುಗಳು_q<SrcScalar, cpy_blck_f32_q2_0, QK2_0>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01,
                                                                            nb02, nb03, ne10, ne11, ne12, nb10, nb11,
                                                                            nb12, nb13, stream);
            ನಿಲ್ಲಿಸು;
        ಸ್ಥಿತಿ GGML_TYPE_Q5_1:
            ggml_sycl_quantize_ಅಡ್ಡಸಾಲುಗಳು_q<SrcScalar, cpy_blck_f32_q5_1, QK5_1>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01,
                                                                            nb02, nb03, ne10, ne11, ne12, nb10, nb11,
                                                                            nb12, nb13, stream);
            ನಿಲ್ಲಿಸು;
        ಸ್ಥಿತಿ GGML_TYPE_Q5_0:
            ggml_sycl_quantize_ಅಡ್ಡಸಾಲುಗಳು_q<SrcScalar, cpy_blck_f32_q5_0, QK5_0>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01,
                                                                            nb02, nb03, ne10, ne11, ne12, nb10, nb11,
                                                                            nb12, nb13, stream);
            ನಿಲ್ಲಿಸು;
        ಸ್ಥಿತಿ GGML_TYPE_Q4_1:
            ggml_sycl_quantize_ಅಡ್ಡಸಾಲುಗಳು_q<SrcScalar, cpy_blck_f32_q4_1, QK4_1>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01,
                                                                            nb02, nb03, ne10, ne11, ne12, nb10, nb11,
                                                                            nb12, nb13, stream);
            ನಿಲ್ಲಿಸು;
        ಸ್ಥಿತಿ GGML_TYPE_Q4_0:
            ggml_sycl_quantize_ಅಡ್ಡಸಾಲುಗಳು_q<SrcScalar, cpy_blck_f32_q4_0, QK4_0>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01,
                                                                            nb02, nb03, ne10, ne11, ne12, nb10, nb11,
                                                                            nb12, nb13, stream);
            ನಿಲ್ಲಿಸು;
        ಸ್ಥಿತಿ GGML_TYPE_IQ4_NL:
            ggml_sycl_quantize_ಅಡ್ಡಸಾಲುಗಳು_q<SrcScalar, cpy_blck_f32_iq4_nl, QK4_NL>(cx, cdst, ne, ne00, ne01, ne02, nb00,
                                                                               nb01, nb02, nb03, ne10, ne11, ne12,
                                                                               nb10, nb11, nb12, nb13, stream);
            ನಿಲ್ಲಿಸು;
        ಸ್ಥಿತಿ GGML_TYPE_MXFP4:
            ggml_sycl_quantize_ಅಡ್ಡಸಾಲುಗಳು_q<SrcScalar, cpy_blck_f32_mxfp4, QK_MXFP4>(cx, cdst, ne, ne00, ne01, ne02, nb00,
                                                                                nb01, nb02, nb03, ne10, ne11, ne12,
                                                                                nb10, nb11, nb12, nb13, stream);
            ನಿಲ್ಲಿಸು;
        ಸ್ಥಿತಿ GGML_TYPE_NVFP4:
            ggml_sycl_quantize_ಅಡ್ಡಸಾಲುಗಳು_q<SrcScalar, cpy_blck_f32_nvfp4, QK_NVFP4>(cx, cdst, ne, ne00, ne01, ne02, nb00,
                                                                                nb01, nb02, nb03, ne10, ne11, ne12,
                                                                                nb10, nb11, nb12, nb13, stream);
            ನಿಲ್ಲಿಸು;
        ಪೂರ್ವನಿಯೋಜಿತ:
            GGML_ABORT("unsupported quantized target type in sycl quantizer src1->type=%s\n",
                       ggml_type_name(src1->type));
    }
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_f16_f16_sycl(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = (ne + SYCL_CPY_ಖಂಡ_ಗಾತ್ರ - 1) / SYCL_CPY_ಖಂಡ_ಗಾತ್ರ;
    {
        dpct::has_capability_or_fail(stream->get_device(), { sycl::aspect::fp16 });

        stream->parallel_for(
            sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ),
                              sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
            [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
                cpy_f32_f16<cpy_1_f16_f16>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12,
                                           nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
            });
    }
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_i16_i16_sycl(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = (ne + SYCL_CPY_ಖಂಡ_ಗಾತ್ರ - 1) / SYCL_CPY_ಖಂಡ_ಗಾತ್ರ;
    {
        // dpct::has_capability_or_fail(stream->get_device(),
        //                              {sycl::aspect::fp16});

        stream->parallel_for(
            sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ),
                              sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
            [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
                cpy_f32_f16<cpy_1_i16_i16>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12,
                                           nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
            });
    }
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_i32_i32_sycl(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = (ne + SYCL_CPY_ಖಂಡ_ಗಾತ್ರ - 1) / SYCL_CPY_ಖಂಡ_ಗಾತ್ರ;
    {
        // dpct::has_capability_or_fail(stream->get_device(),
        //                              {sycl::aspect::fp16});

        stream->parallel_for(
            sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ),
                              sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
            [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
                cpy_f32_f16<cpy_1_i32_i32>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12,
                                           nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
            });
    }
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_q8_0_q8_0(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK8_0 == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK8_0, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(
        sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ),
                              sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
                              [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
            cpy_q_q<ಖಂಡ_q8_0, QK8_0>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
        });
}


ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_q5_0_q5_0(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK5_0 == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK5_0, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(
        sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ),
                              sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
                              [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
            cpy_q_q<ಖಂಡ_q5_0, QK5_0>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
        });
}


ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_q5_1_q5_1(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK5_1 == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK5_1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);

    stream->parallel_for(
        sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ),
                              sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
                              [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
            cpy_q_q<ಖಂಡ_q5_1, QK5_1>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
        });
}


ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_q4_0_q4_0(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK4_0 == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK4_0, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(
        sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ), sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
        [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
            cpy_q_q<ಖಂಡ_q4_0, QK4_0>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
        });
}


ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_q4_1_q4_1(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {

    GGML_ASSERT(ne % QK4_1 == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK4_1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(
        sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ), sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
        [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
            cpy_q_q<ಖಂಡ_q4_1, QK4_1>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
        });
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_q1_0_q1_0(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK1_0 == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK1_0, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(
        sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ), sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
        [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]] {
            cpy_q_q<ಖಂಡ_q1_0, QK1_0>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
        });
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_q2_0_q2_0(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK2_0 == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK2_0, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(
        sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ), sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
        [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
            cpy_q_q<ಖಂಡ_q2_0, QK2_0>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
        });
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_mxfp4_mxfp4(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK_MXFP4 == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK_MXFP4, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(
        sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ), sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
        [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]] {
            cpy_q_q<ಖಂಡ_mxfp4, QK_MXFP4>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
        });
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_nvfp4_nvfp4(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK_NVFP4 == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK_NVFP4, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(
        sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ), sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
        [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
            cpy_q_q<ಖಂಡ_nvfp4, QK_NVFP4>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
        });
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_q2_K_q2_K(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK_K == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK_K, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(
        sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ), sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
        [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
            cpy_q_q<ಖಂಡ_q2_K, QK_K>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
        });
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_q3_K_q3_K(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK_K == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK_K, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(
        sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ), sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
        [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
            cpy_q_q<ಖಂಡ_q3_K, QK_K>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
        });
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_q4_K_q4_K(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK_K == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK_K, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(
        sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ), sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
        [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
            cpy_q_q<ಖಂಡ_q4_K, QK_K>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
        });
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_q5_K_q5_K(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK_K == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK_K, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(
        sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ), sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
        [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
            cpy_q_q<ಖಂಡ_q5_K, QK_K>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
        });
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_q6_K_q6_K(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK_K == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK_K, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(
        sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ), sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
        [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
            cpy_q_q<ಖಂಡ_q6_K, QK_K>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
        });
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_iq2_xxs_iq2_xxs(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK_K == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK_K, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(
        sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ), sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
        [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
            cpy_q_q<ಖಂಡ_iq2_xxs, QK_K>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
        });
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_iq2_xs_iq2_xs(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK_K == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK_K, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(
        sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ), sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
        [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
            cpy_q_q<ಖಂಡ_iq2_xs, QK_K>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
        });
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_iq2_s_iq2_s(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK_K == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK_K, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(
        sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ), sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
        [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
            cpy_q_q<ಖಂಡ_iq2_s, QK_K>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
        });
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_iq3_xxs_iq3_xxs(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK_K == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK_K, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(
        sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ), sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
        [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
            cpy_q_q<ಖಂಡ_iq3_xxs, QK_K>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
        });
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_iq1_s_iq1_s(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK_K == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK_K, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(
        sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ), sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
        [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
            cpy_q_q<ಖಂಡ_iq1_s, QK_K>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
        });
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_iq1_m_iq1_m(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK_K == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK_K, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(
        sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ), sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
        [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
            cpy_q_q<ಖಂಡ_iq1_m, QK_K>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
        });
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_iq4_nl_iq4_nl(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK4_NL == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK4_NL, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(
        sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ), sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
        [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
            cpy_q_q<ಖಂಡ_iq4_nl, QK4_NL>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
        });
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_iq3_s_iq3_s(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK_K == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK_K, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(
        sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ), sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
        [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
            cpy_q_q<ಖಂಡ_iq3_s, QK_K>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
        });
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_iq4_xs_iq4_xs(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                   ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    GGML_ASSERT(ne % QK_K == 0);
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = ceil_div(ne / QK_K, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ);
    stream->parallel_for(
        sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ), sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
        [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
            cpy_q_q<ಖಂಡ_iq4_xs, QK_K>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
        });
}

#ವ್ಯಾಖ್ಯಾನಿತವಾದರೆ GGML_SYCL_HAS_BF16
ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_f32_bf16_sycl(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = (ne + SYCL_CPY_ಖಂಡ_ಗಾತ್ರ - 1) / SYCL_CPY_ಖಂಡ_ಗಾತ್ರ;
    stream->parallel_for(
        sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ),
                          sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
        [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
            cpy_f32_f16<cpy_1_f32_bf16>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12,
                                           nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
        });
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_bf16_f32_sycl(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = (ne + SYCL_CPY_ಖಂಡ_ಗಾತ್ರ - 1) / SYCL_CPY_ಖಂಡ_ಗಾತ್ರ;
    stream->parallel_for(
        sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ),
                          sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
        [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
            cpy_f32_f16<cpy_1_bf16_f32>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12,
                                           nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
        });
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_bf16_bf16_sycl(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = (ne + SYCL_CPY_ಖಂಡ_ಗಾತ್ರ - 1) / SYCL_CPY_ಖಂಡ_ಗಾತ್ರ;
    stream->parallel_for(
        sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ),
                          sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
        [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
            cpy_f32_f16<cpy_1_bf16_bf16>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12,
                                            nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
        });
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_f16_bf16_sycl(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = (ne + SYCL_CPY_ಖಂಡ_ಗಾತ್ರ - 1) / SYCL_CPY_ಖಂಡ_ಗಾತ್ರ;
    stream->parallel_for(
        sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ),
                          sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
        [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
            cpy_f32_f16<cpy_1_f16_bf16>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12,
                                           nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
        });
}

ಸ್ಥಿರ ಶೂನ್ಯ ggml_cpy_bf16_f16_sycl(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ * cx, ಅಕ್ಷರ * cdst, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne01,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb00, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb01, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb02, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb03,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne11, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ne12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb10, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb11,
                                  ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb12, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ nb13, ಸರತಿ_ptr stream) {
    ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ ಅಂಕೆ_ಖಂಡಗಳು = (ne + SYCL_CPY_ಖಂಡ_ಗಾತ್ರ - 1) / SYCL_CPY_ಖಂಡ_ಗಾತ್ರ;
    stream->parallel_for(
        sycl::nd_range<3>(sycl::range<3>(1, 1, ಅಂಕೆ_ಖಂಡಗಳು) * sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ),
                          sycl::range<3>(1, 1, SYCL_CPY_ಖಂಡ_ಗಾತ್ರ)),
        [=](sycl::nd_ಅಂಶ<3> ಅಂಶ_ct1) [[sycl::reqd_sub_ಗುಂಪು_ಗಾತ್ರ(WARP_ಗಾತ್ರ)]]{
            cpy_f32_f16<cpy_1_bf16_f16>(cx, cdst, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12,
                                           nb10, nb11, nb12, nb13, ಅಂಶ_ct1);
        });
}
#ಆದರೆ_ಅಂತ್ಯ

ಶೂನ್ಯ ggml_sycl_cpy(ggml_backend_sycl_context & ctx, ಸ್ಥಿರಾಂಕ ggml_tensor * src0, ಸ್ಥಿರಾಂಕ ggml_tensor * src1) ಪ್ರಯತ್ನಿಸು {
    // Unlike other operators ggml_sycl_cpy takes 2 distinct tensors instead of a dst ggml_tensor and rely on its src field
    GGML_SYCL_DEBUG("ggml_sycl_cpy: src0->type=%s, src1->type=%s\n",
        ggml_type_name(src0->type), ggml_type_name(src1->type));
    scope_op_debug_print scope_dbg_print(__func__, src1, /*num_src=*/0, debug_get_tensor_str("\tsrc0", src0));
    ಸ್ಥಿರಾಂಕ int64_t ne = ggml_nelements(src0);
    GGML_ASSERT(ne == ggml_nelements(src1));
    // the cpy kernels index in 32-bit
    GGML_ASSERT(ne <= INT32_MAX);

    GGML_TENSOR_ದ್ವಿಮಾನ_OP_LOCALS01;

    SYCL_CHECK(ggml_sycl_ಗಣ_device(ctx.device));
    ಸರತಿ_ptr main_ಹರಿವು = ctx.stream();

    ಅಕ್ಷರ * src0_ddc = (ಅಕ್ಷರ *) src0->ದತ್ತಾಂಶ;
    ಅಕ್ಷರ * src1_ddc = (ಅಕ್ಷರ *) src1->ದತ್ತಾಂಶ;
    ಆದರೆ ((src0->type == src1->type) && (ggml_is_contiguous(src0) && ggml_is_contiguous(src1))) {
        GGML_SYCL_DEBUG("%s: memcpy path\n", __func__);
        main_ಹರಿವು->ಸ್ಮರಣೆ_ನಕಲು(src1_ddc, src0_ddc, ggml_nbytes(src0));
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_F32 && ggml_sycl_is_quantized_type(src1->type)) {
        GGML_ASSERT(ggml_sycl_can_quantize_ಅಡ್ಡಸಾಲುಗಳು_sycl(src1->type));
        ggml_sycl_quantize_ಅಡ್ಡಸಾಲುಗಳು_sycl<ದಶಮಾಂಶ>(src0_ddc, src1_ddc, src0, src1, ne, ne00, ne01, ne02, nb00, nb01,
                                            nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_F16 && ggml_sycl_is_quantized_type(src1->type)) {
        GGML_ASSERT(ggml_sycl_can_quantize_ಅಡ್ಡಸಾಲುಗಳು_sycl(src1->type));
        ggml_sycl_quantize_ಅಡ್ಡಸಾಲುಗಳು_sycl<sycl::half>(src0_ddc, src1_ddc, src0, src1, ne, ne00, ne01, ne02, nb00,
                                                 nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13,
                                                 main_ಹರಿವು);
#ವ್ಯಾಖ್ಯಾನಿತವಾದರೆ GGML_SYCL_HAS_BF16
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_BF16 && ggml_sycl_is_quantized_type(src1->type)) {
        GGML_ASSERT(ggml_sycl_can_quantize_ಅಡ್ಡಸಾಲುಗಳು_sycl(src1->type));
        ggml_sycl_quantize_ಅಡ್ಡಸಾಲುಗಳು_sycl<ggml_bf16_t>(src0_ddc, src1_ddc, src0, src1, ne, ne00, ne01, ne02,
                                                  nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11,
                                                  nb12, nb13, main_ಹರಿವು);
#ಆದರೆ_ಅಂತ್ಯ
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_F32 && src1->type == GGML_TYPE_F32) {
        ggml_cpy_f32_f32_sycl(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10,
                              nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_F32 && src1->type == GGML_TYPE_F16) {
        ggml_cpy_f32_f16_sycl(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10,
                              nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_F32 && src1->type == GGML_TYPE_I32) {
        ggml_cpy_f32_i32_sycl(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10,
                              nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_F32 && src1->type == GGML_TYPE_Q8_0) {
        ggml_cpy_f32_q8_0_sycl(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10,
                               nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_F32 && src1->type == GGML_TYPE_Q4_0) {
        ggml_cpy_f32_q4_0_sycl(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10,
                               nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_F32 && src1->type == GGML_TYPE_Q4_1) {
        ggml_cpy_f32_q4_1_sycl(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10,
                               nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_F16 && src1->type == GGML_TYPE_F32) {
        ggml_cpy_f16_f32_sycl(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10,
                              nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_F16 && src1->type == GGML_TYPE_F16) {
        ggml_cpy_f16_f16_sycl(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10,
                              nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_F16 && src1->type == GGML_TYPE_Q4_0) {
        ggml_cpy_f16_q4_0_sycl(src0_ddc, src1_ddc, ne, ne00, ne01, ne02,
                               nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_F16 && src1->type == GGML_TYPE_Q4_1) {
        ggml_cpy_f16_q4_1_sycl(src0_ddc, src1_ddc, ne, ne00, ne01, ne02,
                               nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_F16 && src1->type == GGML_TYPE_Q5_0) {
        ggml_cpy_f16_q5_0_sycl(src0_ddc, src1_ddc, ne, ne00, ne01, ne02,
                               nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_I16 && src1->type == GGML_TYPE_I16) {
        ggml_cpy_i16_i16_sycl(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10,
                              nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_I32 && src1->type == GGML_TYPE_I32) {
        ggml_cpy_i32_i32_sycl(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10,
                              nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_I32 && src1->type == GGML_TYPE_F32) {
        ggml_cpy_i32_f32_sycl(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10,
                              nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_Q4_0 && src1->type == GGML_TYPE_F32) {
        ggml_cpy_q4_0_f32_sycl(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10,
                               nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_Q4_1 && src1->type == GGML_TYPE_F32) {
        ggml_cpy_q4_1_f32_sycl(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10,
                               nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_Q8_0 && src1->type == GGML_TYPE_F32) {
        ggml_cpy_q8_0_f32_sycl(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10,
                               nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_Q2_0 && src1->type == GGML_TYPE_F32) {
        ggml_cpy_q2_0_f32_sycl(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12,
                               nb10, nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_F32 && src1->type == GGML_TYPE_Q5_0) {
        ggml_cpy_f32_q5_0_sycl(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10,
                               nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_Q5_0 && src1->type == GGML_TYPE_F32) {
        ggml_cpy_q5_0_f32_sycl(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10,
                               nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_F32 && src1->type == GGML_TYPE_Q5_1) {
        ggml_cpy_f32_q5_1_sycl(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10,
                               nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_Q5_1 && src1->type == GGML_TYPE_F32) {
        ggml_cpy_q5_1_f32_sycl(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10,
                               nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_MXFP4 && src1->type == GGML_TYPE_F32) {
        ggml_cpy_mxfp4_f32_sycl(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12,
                                nb10, nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_F32 && src1->type == GGML_TYPE_IQ4_NL) {
        ggml_cpy_f32_iq4_nl_sycl(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12,
                                 nb10, nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_Q8_0 && src1->type == GGML_TYPE_Q8_0) {
        ggml_cpy_q8_0_q8_0(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_Q5_0 && src1->type == GGML_TYPE_Q5_0) {
        ggml_cpy_q5_0_q5_0(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_Q5_1 && src1->type == GGML_TYPE_Q5_1) {
        ggml_cpy_q5_1_q5_1(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_Q4_0 && src1->type == GGML_TYPE_Q4_0) {
        ggml_cpy_q4_0_q4_0(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_Q4_1 && src1->type == GGML_TYPE_Q4_1) {
        ggml_cpy_q4_1_q4_1(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_Q1_0 && src1->type == GGML_TYPE_Q1_0) {
        ggml_cpy_q1_0_q1_0(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_Q2_0 && src1->type == GGML_TYPE_Q2_0) {
        ggml_cpy_q2_0_q2_0(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_MXFP4 && src1->type == GGML_TYPE_MXFP4) {
        ggml_cpy_mxfp4_mxfp4(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_NVFP4 && src1->type == GGML_TYPE_NVFP4) {
        ggml_cpy_nvfp4_nvfp4(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_Q2_K && src1->type == GGML_TYPE_Q2_K) {
        ggml_cpy_q2_K_q2_K(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_Q3_K && src1->type == GGML_TYPE_Q3_K) {
        ggml_cpy_q3_K_q3_K(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_Q4_K && src1->type == GGML_TYPE_Q4_K) {
        ggml_cpy_q4_K_q4_K(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_Q5_K && src1->type == GGML_TYPE_Q5_K) {
        ggml_cpy_q5_K_q5_K(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_Q6_K && src1->type == GGML_TYPE_Q6_K) {
        ggml_cpy_q6_K_q6_K(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_IQ2_XXS && src1->type == GGML_TYPE_IQ2_XXS) {
        ggml_cpy_iq2_xxs_iq2_xxs(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_IQ2_XS && src1->type == GGML_TYPE_IQ2_XS) {
        ggml_cpy_iq2_xs_iq2_xs(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_IQ2_S && src1->type == GGML_TYPE_IQ2_S) {
        ggml_cpy_iq2_s_iq2_s(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_IQ3_XXS && src1->type == GGML_TYPE_IQ3_XXS) {
        ggml_cpy_iq3_xxs_iq3_xxs(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_IQ1_S && src1->type == GGML_TYPE_IQ1_S) {
        ggml_cpy_iq1_s_iq1_s(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_IQ1_M && src1->type == GGML_TYPE_IQ1_M) {
        ggml_cpy_iq1_m_iq1_m(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_IQ4_NL && src1->type == GGML_TYPE_IQ4_NL) {
        ggml_cpy_iq4_nl_iq4_nl(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_IQ3_S && src1->type == GGML_TYPE_IQ3_S) {
        ggml_cpy_iq3_s_iq3_s(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_IQ4_XS && src1->type == GGML_TYPE_IQ4_XS) {
        ggml_cpy_iq4_xs_iq4_xs(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10, nb11, nb12, nb13, main_ಹರಿವು);
#ವ್ಯಾಖ್ಯಾನಿತವಾದರೆ GGML_SYCL_HAS_BF16
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_F32 && src1->type == GGML_TYPE_BF16) {
        ggml_cpy_f32_bf16_sycl(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10,
                              nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_BF16 && src1->type == GGML_TYPE_F32) {
        ggml_cpy_bf16_f32_sycl(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10,
                              nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_BF16 && src1->type == GGML_TYPE_BF16) {
        ggml_cpy_bf16_bf16_sycl(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10,
                               nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_F16 && src1->type == GGML_TYPE_BF16) {
        ggml_cpy_f16_bf16_sycl(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10,
                              nb11, nb12, nb13, main_ಹರಿವು);
    } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (src0->type == GGML_TYPE_BF16 && src1->type == GGML_TYPE_F16) {
        ggml_cpy_bf16_f16_sycl(src0_ddc, src1_ddc, ne, ne00, ne01, ne02, nb00, nb01, nb02, nb03, ne10, ne11, ne12, nb10,
                              nb11, nb12, nb13, main_ಹರಿವು);
#ಆದರೆ_ಅಂತ್ಯ
    } ಇಲ್ಲದಿದ್ದರೆ {
        GGML_LOG_ERROR("%s: unsupported type combination (%s to %s)\n", __func__, ggml_type_name(src0->type),
                       ggml_type_name(src1->type));
        GGML_ABORT("fatal error");
    }
} ಹಿಡಿ (ಸ್ಥಿರಾಂಕ sycl::exception & exc) {
    std::cerr << exc.what() << "Exception caught at file:" << __FILE__ << ", line:" << __LINE__ << std::ಸಾಲು_ಅಂತ್ಯ;
    std::ನಿರ್ಗಮಿಸು(1);
}

ಶೂನ್ಯ ggml_sycl_dup(ggml_backend_sycl_context & ctx, ggml_tensor * dst) {
    scope_op_debug_print scope_dbg_print(__func__, dst, /*num_src=*/1);
    ggml_sycl_cpy(ctx, dst->src[0], dst);
}
